app/Models/User.php

SELECT *
FROM `user`
WHERE `login` = 'admin'
 LIMIT 1
---
    public function getUserByLogin($login)
    {
        return $this->where('login', $login)->first();